artillery/scripts/test_get_cookies.yaml
config:
  target: http://74.178.104.83:8080/tukano/rest
  plugins:
    metrics-by-endpoint: {} # Used to get metrics for each endpoint individually.
  processor: ./test-utils.js
  phases:
  - name: "Main test"    # MAIN TESTS: duration: 30s, with 10 new clients/sec. Should be varied depending on scenario.
    duration: 5
    arrivalRate: 1
scenarios:
  - name: 'Upload short'
    weight: 10
    flow:
      - get:
          beforeRequest: "getLoginDetails"
          url: "/users/{{ userId }}?pwd={{ pwd }}"
      - post:
          url: "/shorts/{{ userId }}?pwd={{ pwd }}"
          afterResponse: "processVideoAddReply"
      - post:
          beforeRequest: "uploadBlobBody"
          url: "/blobs/{{ blobUrl }}"